Tekla Open API Reference for Tekla Structures 2025
InputObjectDependencyAttribute.Type Property
 Returns the type of the input object dependency.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginBase.InputObjectDependency Type { get; }
Public ReadOnly Property Type As PluginBase.InputObjectDependency
	Get
Property Value
Type: PluginBase.InputObjectDependency
See Also
Reference
InputObjectDependencyAttribute Class
Tekla.Structures.Plugins Namespace